{
     "segmented": [
          "Dumbledore had convinced Harry not to go looking for the Mirror of Erised again, and for the rest of the Christmas holidays the invisibility cloak stayed folded at the bottom of his trunk. Harry wished he could forget what he'd seen in the mirror as easily, but he couldn't. He started having nightmares. Over and over again he dreamed about his parents disappearing in a flash of green light, while a high voice cackled with laughter.\n\n\"You see, Dumbledore was right, that mirror could drive you mad,\" said Ron, when Harry told him about these dreams.\n\nHermione, who came back the day before term started, took a different view of things. She was torn between horror at the idea of Harry being out of bed, roaming the school three nights in a row (\"If Filch had caught you!\"), and disappointment that he hadn't at least found out who Nicolas Flamel was.\n\nThey had almost given up hope of ever finding Flamel in a library book, even though Harry was still sure he'd read the name somewhere. Once term had started, they were back to skimming through books for ten minutes during their breaks. Harry had even less time than the other two, because Quidditch practice had started again.\n\nWood was working the team harder than ever. Even the endless rain that had replaced the snow couldn't dampen his spirits. The Weasleys complained that Wood was becoming a fanatic, but Harry was on Wood's side. If they won their next match, against Hufflepuff, they would overtake Slytherin in the house championship for the first time in seven years. Quite apart from wanting to win, Harry found that he had fewer nightmares when he was tired out after training.\n\nThen, during one particularly wet and muddy practice session, Wood gave the team a bit of bad news. He'd just gotten very angry with the Weasleys, who kept dive-bombing each other and pretending to fall off their brooms.\n\n\"Will you stop messing around!\" he yelled. \"That's exactly the sort of thing that'll lose us the match! Snape's refereeing this time, and he'll be looking for any excuse to knock points off Gryffindor!\"\n\nGeorge Weasley really did fall off his broom at these words.\n\n\"Snape's refereeing?\" he spluttered through a mouthful of mud. \"When's he ever refereed a Quidditch match? He's not going to be fair if we might overtake Slytherin.\"\n\nThe rest of the team landed next to George to complain, too.\n\n\"It's not my fault,\" said Wood. \"We've just got to make sure we play a clean game, so Snape hasn't got an excuse to pick on us.\"\n\nWhich was all very well, thought Harry, but he had another reason for not wanting Snape near him while he was playing Quidditch...\n\nThe rest of the team hung back to talk to one another as usual at the end of practice, but Harry headed straight back to the Gryffindor common room, where he found Ron and Hermione playing chess. Chess was the only thing Hermione ever lost at, something Harry and Ron thought was very good for her.\n\n\"Don't talk to me for a moment,\" said Ron when Harry sat down next to him, \"I need to concen--\" He caught sight of Harry's face.\n\n\"What's the matter with you? You look terrible.\"\n\nSpeaking quietly so that no one else would hear, Harry told the other two about Snape's sudden, sinister desire to be a Quidditch referee.\n\n\"Don't play,\" said Hermione at once.\n\n\"Say you're ill,\" said Ron.\n\n\"Pretend to break your leg,\" Hermione suggested.\n\n\"Really break your leg,\" said Ron.\n\n\"I can't,\" said Harry. \"There isn't a reserve Seeker. If I back out, Gryffindor can't play at all.\"\n\nAt that moment Neville toppled into the common room. How he had managed to climb through the portrait hole was anyone's guess, because his legs had been stuck together with what they recognized at once as the Leg-Locker Curse. He must have had to bunny hop all the way up to Gryffindor tower.\n\nEveryone fell over laughing except Hermione, who leapt up and performed the countercurse. Neville's legs sprang apart and he got to his feet, trembling. \"What happened?\" Hermione asked him, leading him over to sit with Harry and Ron.\n\n\"Malfoy,\" said Neville shakily. \"I met him outside the library. He said he'd been looking for someone to practice that on.\"\n\n\"Go to Professor McGonagall!\" Hermione urged Neville. \"Report him!\"\n\nNeville shook his head.\n\n\"I don't want more trouble,\" he mumbled.\n\n\"You've got to stand up to him, Neville!\" said Ron. \"He's used to walking all over people, but that's no reason to lie down in front of him and make it easier.\"\n\n\"There's no need to tell me I'm not brave enough to be in Gryffindor, Malfoy's already done that,\" Neville choked out.\n\nHarry felt in the pocket of his robes and pulled out a Chocolate Frog, the very last one from the box Hermione had given him for Christmas. He gave it to Neville, who looked as though he might cry.\n\n\"You're worth twelve of Malfoy,\" Harry said. \"The Sorting Hat chose you for Gryffindor, didn't it? And where's Malfoy? In stinking Slytherin.\"\n\nNeville's lips twitched in a weak smile as he unwrapped the frog.\n\n\"Thanks, Harry... I think I'll go to bed... D'you want the card, you collect them, don't you?\"\n\nAs Neville walked away, Harry looked at the Famous Wizard card.\n\n",
          "\"Dumbledore again,\" he said, \"He was the first one I ever --\"\n\nHe gasped. He stared at the back of the card. Then he looked up at Ron and Hermione.\n\n\"I've found him!\" he whispered. \"I've found Flamel! I told you I'd read the name somewhere before, I read it on the train coming here -- listen to this: 'Dumbledore is particularly famous for his defeat of the dark wizard Grindelwald in 1945, for the discovery of the twelve uses of dragon's blood, and his work on alchemy with his partner, Nicolas Flamel'!\"\n\nHermione jumped to her feet. She hadn't looked so excited since they'd gotten back the marks for their very first piece of homework.\n\n\"Stay there!\" she said, and she sprinted up the stairs to the girls' dormitories. Harry and Ron barely had time to exchange mystified looks before she was dashing back, an enormous old book in her arms.\n\n\"I never thought to look in here!\" she whispered excitedly. \"I got this out of the library weeks ago for a bit of light reading.\"\n\n\"Light?\" said Ron, but Hermione told him to be quiet until she'd looked something up, and started flicking frantically through the pages, muttering to herself.\n\nAt last she found what she was looking for.\n\n\"I knew it! I knew it!\"\n\n\"Are we allowed to speak yet?\" said Ron grumpily. Hermione ignored him.\n\n\"Nicolas Flamel,\" she whispered dramatically, \"is the only known maker of the Sorcerer's Stone!\"\n\nThis didn't have quite the effect she'd expected.\n\n\"The what?\" said Harry and Ron.\n\n\"Oh, honestly, don't you two read? Look - read that, there.\"\n\nShe pushed the book toward them, and Harry and Ron read:\n\nThe ancient study of alchemy is concerned with making the Sorcerer's Stone, a legendary substance with astonishing powers. The stone will transform any metal into pure gold. It also produces the Elixir of Life, which will make the drinker immortal.\n\nThere have been many reports of the Sorcerer's Stone over the centuries, but the only Stone currently in existence belongs to Mr. Nicolas Flamel, the noted alchemist and opera lover. Mr. Flamel, who celebrated his six hundred and sixty-fifth birthday last year, enjoys a quiet life in Devon with his wife, Perenelle (six hundred and fifty-eight).\n\n\"See?\" said Hermione, when Harry and Ron had finished. \"The dog must be guarding Flamel's Sorcerer's Stone! I bet he asked Dumbledore to keep it safe for him, because they're friends and he knew someone was after it, that's why he wanted the Stone moved out of Gringotts!\"\n\n\"A stone that makes gold and stops you from ever dying!\" said Harry. \"No wonder Snape's after it! Anyone would want it.\"\n\n\"And no wonder we couldn't find Flamel in that Study of Recent Developments in Wizardry,\" said Ron. \"He's not exactly recent if he's six hundred and sixty-five, is he?\"\n\n",
          "The next morning in Defense Against the Dark Arts, while copying down different ways of treating werewolf bites, Harry and Ron were still discussing what they'd do with a Sorcerer's Stone if they had one. It wasn't until Ron said he'd buy his own Quidditch team that Harry remembered about Snape and the coming match.\n\n\"I'm going to play,\" he told Ron and Hermione. \"If I don't, all the Slytherins will think I'm just too scared to face Snape. I'll show them... it'll really wipe the smiles off their faces if we win.\"\n\n\"Just as long as we're not wiping you off the field,\" said Hermione.\n\nAs the match drew nearer, however, Harry became more and more nervous, whatever he told Ron and Hermione. The rest of the team wasn't too calm, either. The idea of overtaking Slytherin in the house championship was wonderful, no one had done it for seven years, but would they be allowed to, with such a biased referee?\n\nHarry didn't know whether he was imagining it or not, but he seemed to keep running into Snape wherever he went. At times, he even wondered whether Snape was following him, trying to catch him on his own. Potions lessons were turning into a sort of weekly torture, Snape was so horrible to Harry. Could Snape possibly know they'd found out about the Sorcerer's Stone? Harry didn't see how he could -- yet he sometimes had the horrible feeling that Snape could read minds.\n\nHarry knew, when they wished him good luck outside the locker rooms the next afternoon, that Ron and Hermione were wondering whether they'd ever see him alive again. This wasn't what you'd call comforting. Harry hardly heard a word of Wood's pep talk as he pulled on his Quidditch robes and picked up his Nimbus Two Thousand.\n\nRon and Hermione, meanwhile, had found a place in the stands next to Neville, who couldn't understand why they looked so grim and worried, or why they had both brought their wands to the match. Little did Harry know that Ron and Hermione had been secretly practicing the Leg-Locker Curse. They'd gotten the idea from Malfoy using it on Neville, and were ready to use it on Snape if he showed any sign of wanting to hurt Harry.\n\n\"Now, don't forget, it's Locomotor Mortis,\" Hermione muttered as Ron slipped his wand up his sleeve.\n\n\"I know,\" Ron snapped. \"Don't nag.\"\n\nBack in the locker room, Wood had taken Harry aside.\n\n\"Don't want to pressure you, Potter, but if we ever need an early capture of the Snitch it's now. Finish the game before Snape can favor Hufflepuff too much.\"\n\n\"The whole school's out there!\" said Fred Weasley, peering out of the door. \"Even -- blimey -- Dumbledore's come to watch!\"\n\nHarry's heart did a somersault.\n\n\"Dumbledore?\" he said, dashing to the door to make sure. Fred was right. There was no mistaking that silver beard.\n\nHarry could have laughed out loud with relief, he was safe. There was simply no way that Snape would dare to try to hurt him if Dumbledore was watching.\n\nPerhaps that was why Snape was looking so angry as the teams marched onto the field, something that Ron noticed, too.\n\n\"I've never seen Snape look so mean,\" he told Hermione. \"Look -- they're off. Ouch!\"\n\nSomeone had poked Ron in the back of the head. It was Malfoy.\n\n\"Oh, sorry, Weasley, didn't see you there.\" Malfoy grinned broadly at Crabbe and Goyle.\n\n\"Wonder how long Potter's going to stay on his broom this time? Anyone want a bet? What about you, Weasley?\"\n\nRon didn't answer; Snape had just awarded Hufflepuff a penalty because George Weasley had hit a Bludger at him. Hermione, who had all her fingers crossed in her lap, was squinting fixedly at Harry, who was circling the game like a hawk, looking for the Snitch.\n\n\"You know how I think they choose people for the Gryffindor team?\" said Malfoy loudly a few minutes later, as Snape awarded Hufflepuff another penalty for no reason at all. \"It's people they feel sorry for. See, there's Potter, who's got no parents, then there's the Weasleys, who've got no money -- you should be on the team, Longbottom, you've got no brains.\"\n\nNeville went bright red but turned in his seat to face Malfoy.\n\n\"I'm worth twelve of you, Malfoy,\" he stammered.\n\nMalfoy, Crabbe, and Goyle howled with laughter, but Ron, still not daring to take his eyes from the game, said, \"You tell him, Neville.\"\n\n\"Longbottom, if brains were gold you'd be poorer than Weasley, and that's saying something.\"\n\nRon's nerves were already stretched to the breaking point with anxiety about Harry.\n\n\"I'm warning you, Malfoy -- one more word--\"\n\n\"Ron!\" said Hermione suddenly, \"Harry --\"\n\n\"What? Where?\"\n\nHarry had suddenly gone into a spectacular dive, which drew gasps and cheers from the crowd. Hermione stood up, her crossed fingers in her mouth, as Harry streaked toward the ground like a bullet.\n\n\"You're in luck, Weasley, Potter's obviously spotted some money on the ground!\" said Malfoy.\n\nRon snapped. Before Malfoy knew what was happening, Ron was on top of him, wrestling him to the ground. Neville hesitated, then clambered over the back of his seat to help.\n\n\"Come on, Harry!\" Hermione screamed, leaping onto her seat to watch as Harry sped straight at Snape -- she didn't even notice Malfoy and Ron rolling around under her seat, or the scuffles and yelps coming from the whirl of fists that was Neville, Crabbe, and Goyle.\n\nUp in the air, Snape turned on his broomstick just in time to see something scarlet shoot past him, missing him by inches -- the next second, Harry had pulled out of the dive, his arm raised in triumph, the Snitch clasped in his hand.\n\nThe stands erupted; it had to be a record, no one could ever remember the Snitch being caught so quickly.\n\n\"Ron! Ron! Where are you? The game's over! Harry's won! We've won! Gryffindor is in the lead!\" shrieked Hermione, dancing up and down on her seat and hugging Parvati Patil in the row in front.\n\nHarry jumped off his broom, a foot from the ground. He couldn't believe it. He'd done it -- the game was over; it had barely lasted five minutes. As Gryffindors came spilling onto the field, he saw Snape land nearby, white-faced and tight-lipped -- then Harry felt a hand on his shoulder and looked up into Dumbledore's smiling face.\n\n\"Well done,\" said Dumbledore quietly, so that only Harry could hear. \"Nice to see you haven't been brooding about that mirror... been keeping busy... excellent...\"\n\nSnape spat bitterly on the ground.\n\nHarry left the locker room alone some time later, to take his Nimbus Two Thousand back to the broomshed. He couldn't ever remember feeling happier. He'd really done something to be proud of now - no one could say he was just a famous name any more. The evening air had never smelled so sweet. He walked over the damp grass, reliving the last hour in his head, which was a happy blur: Gryffindors running to lift him onto their shoulders; Ron and Hermione in the distance, jumping up and down, Ron cheering through a heavy nosebleed.\n\nHarry had reached the shed. He leaned against the wooden door and looked up at Hogwarts, with its windows glowing red in the setting sun. Gryffindor in the lead. He'd done it, he'd shown Snape...\n\nAnd speaking of Snape...\n\nA hooded figure came swiftly down the front steps of the castle. Clearly not wanting to be seen, it walked as fast as possible toward the forbidden forest. Harry's victory faded from his mind as he watched. He recognized the figure's prowling walk. Snape, sneaking into the forest while everyone else was at dinner -- what was going on?\n\nHarry jumped back on his Nimbus Two Thousand and took off. Gliding silently over the castle he saw Snape enter the forest at a run. He followed.\n\nThe trees were so thick he couldn't see where Snape had gone. He flew in circles, lower and lower, brushing the top branches of trees until he heard voices. He glided toward them and landed noiselessly in a towering beech tree.\n\nHe climbed carefully along one of the branches, holding tight to his broomstick, trying to see through the leaves. Below, in a shadowy clearing, stood Snape, but he wasn't alone. Quirrell was there, too. Harry couldn't make out the look on his face, but he was stuttering worse than ever. Harry strained to catch what they were saying.\n\n",
          "\"... d-don't know why you wanted t-t-to meet here of all p-places, Severus...\"\n\n\"Oh, I thought we'd keep this private,\" said Snape, his voice icy. \"Students aren't supposed to know about the Sorcerer's Stone, after all.\"\n\nHarry leaned forward. Quirrell was mumbling something. Snape interrupted him.\n\n\"Have you found out how to get past that beast of Hagrid's yet?\"\n\n\"B-b-but Severus, I --\"\n\n\"You don't want me as your enemy, Quirrell,\" said Snape, taking a step toward him.\n\n\"I-I don't know what you--\"\n\n\"You know perfectly well what I mean.\"\n\nAn owl hooted loudly, and Harry nearly fell out of the tree. He steadied himself in time to hear Snape say, \"-- your little bit of hocus-pocus. I'm waiting.\"\n\n\"B-but I d-d-don't --\"\n\n\"Very well,\" Snape cut in. \"We'll have another little chat soon, when you've had time to think things over and decided where your loyalties lie.\"\n\nHe threw his cloak over his head and strode out of the clearing. It was almost dark now, but Harry could see Quirrell, standing quite still as though he was petrified.\n\n\"Harry, where have you been?\" Hermione squeaked.\n\n\"We won! You won! We won!\" shouted Ron, thumping Harry on the back. \"And I gave Malfoy a black eye, and Neville tried to take on Crabbe and Goyle single-handed! He's still out cold but Madam Pomfrey says he'll be all right -- talk about showing Slytherin! Everyone's waiting for you in the common room, we're having a party, Fred and George stole some cakes and stuff from the kitchens.\"\n\n\"Never mind that now,\" said Harry breathlessly. \"Let's find an empty room, you wait 'til you hear this...\"\n\nHe made sure Peeves wasn't inside before shutting the door behind them, then he told them what he'd seen and heard.\n\n\"So we were right, it is the Sorcerer's Stone, and Snape's trying to force Quirrell to help him get it. He asked if he knew how to get past Fluffy -- and he said something about Quirrell's 'hocus pocus' -- I reckon there are other things guarding the stone apart from Fluffy, loads of enchantments, probably, and Quirrell would have done some anti-Dark Arts spell that Snape needs to break through --\"\n\n\"So you mean the Stone's only safe as long as Quirrell stands up to Snape?\" said Hermione in alarm.\n\n\"It'll be gone by next Tuesday,\" said Ron.\n\n"
     ]
}